#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-resize-hhassen-2022-bucket]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-resize-hhassen-2022-bucket]
aws_ssm_parameter.endpoint: Refreshing state... [id=/resize-image/s3/name]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ssm_parameter.endpoint has changed
  ~ resource "aws_ssm_parameter" "endpoint" {
        id          = "/resize-image/s3/name"
        name        = "/resize-image/s3/name"
      + tags        = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ssm_parameter.endpoint will be updated in-place
  ~ resource "aws_ssm_parameter" "endpoint" {
      ~ description = "image-resize-hhassen-2022-bucket BUCKET NAME" -> "resize-image-hhassen-2022-bucket BUCKET NAME"
        id          = "/resize-image/s3/name"
        name        = "/resize-image/s3/name"
        tags        = {}
      ~ value       = (sensitive value)
      ~ version     = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.s3_bucket.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::image-resize-hhassen-2022-bucket" -> (known after apply)
      ~ bucket                      = "image-resize-hhassen-2022-bucket" -> "resize-image-hhassen-2022-bucket" # forces replacement
      ~ bucket_domain_name          = "image-resize-hhassen-2022-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "image-resize-hhassen-2022-bucket.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "image-resize-hhassen-2022-bucket" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "environment" = "prod"
            "managed_by"  = "terraform"
            "project"     = "resize-image"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "image-resize-hhassen-2022-bucket" -> (known after apply) # forces replacement
      ~ id                      = "image-resize-hhassen-2022-bucket" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.s3_bucket.aws_s3_bucket.this,
  on .terraform/modules/s3_bucket/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_website_configuration resource instead

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @hhassen, Action: `pull_request`*